import Image from "next/image";

import Button from "@/components/ButtonComponent";

import Background from "@/images/legal-page/Rectangle.svg";

const deliverySections = [
  {
    title: "Доставка",
    content: [
      "Ми прагнемо забезпечити швидку та надійну доставку, щоб ваші покупки прибували вчасно та у найкращому стані. Наша служба доставки співпрацює з провідними логістичними компаніями, щоб гарантувати, що кожне замовлення обробляється з максимальною увагою до деталей.",
      "Доставка доступна по всій території України, включно з віддаленими регіонами. Ви можете обирати зручний спосіб доставки: кур'єром до дверей або самовивіз із пунктів видачі.",
      "Після оформлення замовлення ви отримаєте підтвердження електронною поштою з усіма деталями замовлення. Коли товар буде відправлено, ви отримаєте номер для відстеження, за допомогою якого зможете контролювати переміщення вашого замовлення в реальному часі.",
      "Ми також пропонуємо безкоштовну доставку для замовлень понад певну суму. Перевірте умови безкоштовної доставки у вашому регіоні на сторінці оформлення замовлення."
    ],
  },
  {
    title: "Час доставки",
    content: [
      "Час доставки залежить від вашого місця розташування та обраного способу доставки. Зазвичай ми обробляємо замовлення протягом 1-2 робочих днів. Після цього доставка може зайняти від 2 до 7 робочих днів, залежно від віддаленості вашого регіону.",
      "Для великих міст доставка займає мінімальний час — у середньому 2-3 робочі дні. Якщо ви перебуваєте в сільській місцевості або у віддаленому регіоні, час доставки може бути довшим, проте ми докладаємо максимум зусиль, щоб скоротити очікування.",
      "Під час національних свят, розпродажів або акцій терміни доставки можуть трохи збільшуватися через високий обсяг замовлень. Ми заздалегідь попереджаємо про можливі затримки та робимо все можливе, щоб замовлення надійшли вчасно.",
      "Ми також надаємо можливість пріоритетної доставки для термінових замовлень. Виберіть цю опцію на етапі оформлення, щоб ваш товар прибув якомога швидше."
    ],
  },
  {
    title: "Ризики доставки",
    content: [
      "Ми піклуємося про те, щоб ваше замовлення було належним чином запаковане та захищене від можливих пошкоджень під час транспортування. Ми використовуємо якісні матеріали для упаковки, включно з багатошаровим картоном та захисними наповнювачами.",
      "Однак, у виняткових випадках можуть виникати пошкодження під час доставки. Якщо ви отримали товар із пошкодженнями, будь ласка, дотримуйтесь наступних інструкцій:",
      "1. Перевірте стан упаковки та товару під час отримання. Якщо є видимі пошкодження, сфотографуйте їх у присутності кур'єра або на пункті видачі.",
      "2. Зв'яжіться з нашою службою підтримки клієнтів протягом 24 годин після отримання товару. Надайте фотографії пошкоджень, упаковки та документ, що підтверджує покупку.",
      "3. Ми швидко розглянемо вашу заявку та запропонуємо заміну товару, повернення коштів або інший варіант вирішення ситуації.",
      "Ваші інтереси завжди є нашим пріоритетом, тому ми гарантуємо оперативну допомогу та справедливе вирішення будь-якої проблеми, пов’язаної з пошкодженням товару."
    ],
  },
];


const LegalSection = () => {
  return (
    <section className="relative bg-pearl flex justify-center items-center">
      <div className="bg-darkMaroon h-[500px] md:h-[700px] w-full absolute bottom-0 z-1">
        <Image
          src={Background}
          alt="Background"
          className="w-full h-full"
          layout="fill"
          objectFit="cover"
        />
      </div>
      <div className="container flex flex-col items-center gap-[30px] pt-[40px] pb-[60px] xl:pb-[150px] z-10">
        <h1 className="font-frontrunner text-center text-[28px] md:text-[32px] lg:text-[48px] text-black">
          Доставка
        </h1>
        <div className="bg-white p-[30px] md:p-[50px] shadow-lg rounded-lg border">
          <div className="flex flex-col gap-[30px] items-start">
            {deliverySections.map((section, index) => (
              <div key={index} className="flex flex-col">
                <h2 className="text-[20px] md:text-[28px] font-semibold  mb-[20px]">
                  {section.title}
                </h2>
                {section.content.map((paragraph, idx) => (
                  <p className="text-gray-600 leading-relaxed mb-[10px]" key={idx}>
                    {paragraph}
                  </p>
                ))}
              </div>
            ))}
          </div>
        </div>
        <div className="flex flex-col items-center py-[40px] px-[20px] rounded-lg gap-[10px]">
          <h3 className="text-[24px] md:text-[36px] font-semibold text-white ">
            Can’t Find The Answer?
          </h3>
          <p className="text-white text-center mb-[10px]">
            Get in touch with our professional team and we will get your answer
            in less than 24h.
          </p> 
          <Button text="Contact Us" tag="a" href="/contact-us" background="onyx" type="submit"/>
        </div>
      </div>
    </section>
  );
};

export default LegalSection;
